{
  "long_text": "In the presence of His Excellency, the Minister of Environment, Water and Agriculture Engineer Abdulrahman AlFadhley, NEOM Company, and Tabuk Fish Company signed a Memorandum of Understanding aimed at expanding local aquaculture production and applying the new generation of aquaculture technologies in the NEOM region. The memorandum included developing a fish farm to promote the aquaculture industry in the region, both within artificial lakes and natural waters, and to establish a solid infrastructure in the Kingdom, in line with Vision 2030, which aims to diversify the country's economy and sources of income. The hatchery will operate with a capacity of 70 million fingerlings, which makes it the largest in the Middle East and North Africa region. It will focus on improving the production of local fish species in the Red Sea to contribute to achieving the Kingdom's goal of producing 600,000 tons of fish products by 2030, placing the Kingdom at the forefront of the pioneering countries in sustainable aquaculture. Dr. Ali Al-Sheikhi, the CEO of the National Fisheries Development Program and Director General of the General Department of Fisheries at the Ministry of Environment, Water and Agriculture, explained that this agreement is a fundamental turning point. It is particularly so with the entry of significant companies such as NEOM Company to invest in the aquaculture industry, seen as one of the most promising and effective industries for supporting economic growth and achieving food security. Commenting on the Memorandum of Understanding, Nadhmi Al-Nasr, CEO of NEOM, said: \"We are pleased to work with Tabuk Fish Company to introduce new technologies and approaches to aquaculture to improve all aspects of farming and sustainability. The capacity and innovative nature of the hatchery, combined with top-notch technologies, will help position Saudi Arabia at the forefront of sustainable marine aquaculture. \"Nasser A. Al-Sharif, Chairman of Tabuk Fish Company, welcomed the collaboration, saying: \"Our collaboration with NEOM will initially focus on creating a state-of-the-art fish hatchery to generate local jobs. It will also attract top technology companies to NEOM, allowing Tabuk Fish Company to establish a variety of new business opportunities and positively impact the NEOM region and beyond. \"Aquaculture is currently the world's fastest-growing food sector and accounts for over 50% of the total global seafood supply. With seafood consumption in the Kingdom projected to grow 7.4% annually, sustainable aquaculture growth is key to meeting this demand and easing pressure on wild fish stocks, which are under stress in the region and worldwide due to overﬁshing."
}